## How advertisers bid on different layers of ad units

In [1]:
import pandas as pd

In [45]:
df = pd.read_csv('../data/bidders_accross_ad_units.csv', thousands=',', dtype={'advertiser':str,'ad_unit':str,'revenue':float,'impressions':int,'ecpm':float})

In [46]:
df.head()

,advertiser,ad_unit,ad_ctr,revenue,impressions,ecpm
0,1-800-Flowers.com,21839579524 » am-android-foryou-large-ib-high,1.38%,275.84,21467,12.85
1,1-800-Flowers.com,21839579524 » am-android-foryou-large-ib-low,0.69%,104.46,33531,3.12
2,1-800-Flowers.com,21839579524 » am-android-foryou-large-ib-medium,0.87%,177.73,33979,5.23
3,1000Bulbs.com,21839579524 » am-android-foryou-large-ib-high,0.98%,64.00,5285,12.11
4,1000Bulbs.com,21839579524 » am-android-foryou-large-ib-low,0.41%,20.89,6900,3.03

In [47]:
appearence = df['advertiser'].value_counts()

In [50]:
app_df = appearence.to_frame(name='appearence')

In [51]:
app_df.index.name = 'advertiser'

In [52]:
app_df['appearence'].value_counts()

3    2879
1     541
2     515
Name: appearence, dtype: int64

In [53]:
adv_grp = df.groupby(['advertiser'])

In [56]:
total_revenue_df = adv_grp['revenue'].sum().to_frame(name='total_revenue')

In [58]:
total_revenue_df.index.name = 'advertiser'

In [60]:
total_revenue_df

                   total_revenue
advertiser
1-800-Flowers.com         558.03
1000Bulbs.com             119.31
1001 Optical                0.02
17 Media                    3.33
1A Auto                     2.73
...                          ...
에듀윌                         0.07
이디엠유학센터'                    0.15
자생한방병원                      0.84
칸투칸                         0.01
파고다 교육그룹                    0.01

[3935 rows x 1 columns]

In [62]:
app_rev_df = pd.concat([app_df, total_revenue_df], axis='columns')

In [68]:
app_rev_df

                          appearence  total_revenue
advertiser
1-800-Flowers.com                  3         558.03
Nuance                             3          18.89
Nordea                             3           0.36
Nordeus                            3           0.81
Nordstrom                          3         253.66
...                              ...            ...
Charles Schwab                     1           0.01
Champlain College                  1           3.69
Singapore Airlines Group           1           0.01
Chal-Tec                           1           0.00
Total                              1      782111.08

[3935 rows x 2 columns]

In [77]:
app_rev_df.drop('Total', inplace=True)

In [78]:
app_rev_df.groupby(['appearence'])['total_revenue'].sum()

appearence
1       313.28
2       166.73
3    781633.40
Name: total_revenue, dtype: float64

In [79]:
app_rev_df['total_revenue'].sum()

782113.4099999999